app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
     def new
         @book = Book.new
         @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @booK = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "fdがジョイgjぽjas"], ["updated_at", "2019-11-16 10:23:23.758229"], ["id", 24]]
---
    def update
        book = Book.find(params[:id])
        book.update(book_params)

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2019-11-17 08:38:01.089507"], ["updated_at", "2019-11-17 08:38:01.089507"]]
---
    def create
        @books = Book.all
        # ストロングパラメーターを使用
        @book = Book.new(book_params)
        # DBへ保存する
        if @book.save

SELECT "books".* FROM "books"
---
    def index
        @books = Book.all #これで全ての投稿を取り出して表示する